[{"content":"Hugo Techdoc Theme The Techdoc is a Hugo Theme for technical documentation. Features  Modern, Simple layout Responsive web design Documentation menu (Select Menu style) Table Of Contents for the page (selective) Theme color Edit link to documentation repository Custom Shortcodes  Code highlight with clipboard Alert panel Button   Search Shortcode powered by Algolia Open Graph Analytics with Google Analytics, Google Tag Manager  ","date":1508426775,"description":"Text about this post","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"/","publishdate":"2018-11-23T15:26:15Z","title":"Home title"},{"content":"Hugo is a static site engine written in Go.\nIt makes use of a variety of open source projects including:\n Cobra Viper J Walter Weatherman Cast  Learn more and contribute on GitHub.\n","date":1397001600,"description":"","lastmod":"2014-04-09T00:00:00Z","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"/about/","publishdate":"2014-04-09T00:00:00Z","title":"About Hugo"},{"content":"","date":-62135596800,"description":"","objectID":"9149df03eef3b95166e46dcf2e7638b7","permalink":"/el-notes/censorship-and-freedom-of-speech/","title":"Censorship and Freedom of Speech"},{"content":"How effective are prisons in addressing the problem of crime? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-35-how-effective-are-prisons-in-addressing-the-problem-of-crime/\nIn the words of Michel Foucault, a French intellectual, prison is “but a recruitment center for the army of crime.” In a time when citizens are increasingly questioning the effectiveness of the criminal justice system and recidivism rates are on the rise, it is necessary to question the effectiveness of imprisonment in mitigating crime. Whether incarceration is successful in eradicating crime thus rests on whether it successfully reforms criminals and whether the act of imprisonment promotes crime in communities in the long term. With these criteria in mind, it can be argued that prisons are only effective in addressing the problem of crime if prison sentences are able to address the root causes of the crime, if resources are diverted to rehabilitation, if prisons maintain a small critical size to prevent the growth of criminal networks, and if prisons are able to mitigate the impact that mass incarceration has on communities.\nPrisons are only able to effectively reform criminals and lower the rates of recidivism if the prison sentence is able to address the root causes of the crime. At first glance, it appears that prisons have failed to prevent convicts from reoffending. According to the National Institute of Justice, about 68 percent of prisoners released in the United States were arrested for a new felony within 3 years, and 77 percent were arrested within 5 years. However, a detailed breakdown of recidivism rates reveals that imprisonment can be effective in rehabilitating criminals, but only if the prison sentence was commensurate to the nature of the crime. Sex offenders and domestic abusers tend to benefit the most from short-term prison sentences, which act to ‘convince the offender that unlawful conduct has serious consequences’. Sex offenders have a recidivism rate of …","date":-62135596800,"description":"","objectID":"d6225b4354d2536ff9961c3129b078af","permalink":"/el-notes/crime-and-punishment/how-effective-are-prisons-in-addressing-the-problem-of-crime/","title":"How effective are prisons in addressing the problem of crime"},{"content":"","date":-62135596800,"description":"","objectID":"49218dabc78cda9f8f90e9e1912fcdce","permalink":"/el-notes/crime-and-punishment/","title":"Crime and Punishment"},{"content":"","date":-62135596800,"description":"","objectID":"9cd3938c12f83f85a13fa9dc86693a6b","permalink":"/el-notes/prejudice-and-discrimination/class/meritocracy/","title":"Meritocracy"},{"content":"","date":-62135596800,"description":"","objectID":"753f78f4a25ecb8d688882ea8ed6fca2","permalink":"/el-notes/prejudice-and-discrimination/class/","title":"Class"},{"content":"\u0026amp;ldquo;Diversity brought about by globalization should be celebrated, not feared.\u0026amp;rdquo; Discuss. Source: https://www.theknowledgeloft.com/gp-essays/diversity-brought-about-by-globalization-should-be-celebrated-not-feared-discuss-gp-essay-4/\nThe world today is more diverse than it has ever been. The advent of globalisation, increasing ease of communication and movement has allowed many different cultures, languages, traditions and beliefs to permeate the world, no longer completely separated by geographical boundaries. This increased diversity has led to many positive effects on the world at large such as greater international cooperation, greater economic growth and improvements to the overall standards of healthcare as the exchange of information becomes more fluid. Yet, despite the positivity associated with diversity, there are those who believe that our trust and focus in creating a more diverse international community has led to countries neglecting the needs of their local people. Although these fears do have some truth in them, the benefits that increased diversity has brought to the world are undeniable and cannot be overlooked, and should therefore be more celebrated than feared.\nAcross the world, the pioneering of new communication technologies has allowed us to become more aware of the extent of diversity across the globe, and this should be celebrated as it has led to greater cooperation within the international community. The Internet has made it easier for individuals to learn languages on their own, and this has in particular led to greater ease of communication between regular individuals and even political leaders, allowing them to communicate with each other in a more relaxed and friendly atmosphere while also ensuring that parties can get their points across without the fear of miscommunication. This is evident through the rise of English as a universal language over the past 10 years, with a Washington Post article in 2015 marking the number of …","date":-62135596800,"description":"","objectID":"de8788f3b33a3a349f5a9b0457e5858f","permalink":"/el-notes/prejudice-and-discrimination/diversity-brought-about-by-globalization-should-be-celebrated-not-feared.-discuss/","title":"Diversity brought about by globalization should be celebrated, not feared. Discuss"},{"content":"","date":-62135596800,"description":"","objectID":"d95aa327a1fc2b77a857819db3742211","permalink":"/el-notes/prejudice-and-discrimination/foreign-workers/","title":"Foreign Workers"},{"content":"Gender Discrimination Sexism in Tech The Elizabeth Holmes Trial Is a Wake-Up Call for Sexism in Tech - Ellen Pao (15/09/2021)\n","date":-62135596800,"description":"","objectID":"5e1c0d3b6701f0a269af3fdafa8c7b2b","permalink":"/el-notes/prejudice-and-discrimination/gender/readme/","title":""},{"content":"","date":-62135596800,"description":"","objectID":"c34acaf62ed5dcfb9e6c78e98a40d479","permalink":"/el-notes/prejudice-and-discrimination/gender/women-in-stem/","title":"Women in STEM"},{"content":"","date":-62135596800,"description":"","objectID":"5f57da59bda62ca24841ade1b8974dd9","permalink":"/el-notes/prejudice-and-discrimination/gender/","title":"Gender"},{"content":"How far is it possible to have a fair and inclusive society in your country? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-22-how-far-is-it-possible-to-have-a-fair-and-inclusive-society-in-your-country/\nIn a meritocratic, pluralistic nation such as Singapore, what does it mean for a society to be ‘fair’ and ‘inclusive’? When there is fairness, the treatment of all individuals is not predicated on indicators which are out of his control, such as race or religion. When a society is inclusive, all members benefit from progress and equality of opportunity, diversity is celebrated instead of shunned, and all individuals are allowed to participate in deciding the creation and direction of social institutions. Singapore is already quite fair and inclusive with the coexistence of diverse racial and religious groups bearing testament to its strong social fabric. That said, however, rampant allegations of micro-aggressions and a society that promotes tolerance instead of genuine acceptance suggest that it is not entirely a completely fair and inclusive one. While it is possible to strive for greater fairness and inclusiveness in Singapore, having one that is entirely equal and accepting is impossible, although this should not stop us from continually striving for one.\nIt is possible to have a fair and inclusive society in Singapore as government policies can aid in the creation of such a society. The importance of procedural equality has been enshrined in Singapore’s Constitution, and has been enforced through non-discriminatory policies. For instance, all individuals are treated equally in the court, with no difference in treatment on the basis of race, religion or social status. Hence, this reinforces the understanding that one’s race, religion or indeed other demarcations of social status do not exempt him from the laws of the country, thereby affirming the concept of fairness. The government has also made known its goal for an inclusive society, one where …","date":-62135596800,"description":"","objectID":"6ea072bb934cf14e849c45385e056fd3","permalink":"/el-notes/prejudice-and-discrimination/how-far-is-it-possible-to-have-a-fair-and-inclusive-society-in-your-country/","title":"How far is it possible to have a fair and inclusive society in your country"},{"content":"How far is the trend towards diversity a positive development? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-13-how-far-is-the-trend-towards-diversity-a-positive-development/\nMany renowned universities such as Harvard are known for admitting students who come from different countries and from different walks of life. The rationale behind this is that their students need to learn how to interact with people with a variety of backgrounds in order to become effective global citizens. Indeed, globalization has made societies today much more diverse since one end of the world is just a plane ride away from the other. However, while the admissions office in Harvard may celebrate diversity, it has to be acknowledged that diversity brings about quite a few challenges as well. Therefore, while the trend towards diversity is largely a positive one, its negative implications cannot be ignored too.\nDiversity is about bringing people who have their own unique ideas and mindsets together. When these people share and exchange their opinions, they may disagree with one another and might even seek to reach a consensus. This is, in essence, democracy because what is the point of “rule by the people for the people” if everyone agrees on every single issue? The trend towards diversity in the political arena is a positive one because one has opposition parties who can act as checks and balances against the ruling party as well as representatives of different groups in society. At the end of every British parliamentary elections, the leader of the second largest party is sworn in as Her Majesty’s most loyal opposition. The apparent paradox of “loyal opposition” is actually a vital ingredient of a healthy democracy – dissent that is expressed in a reasonable and logical fashion that lends itself to compromise and is ultimately for the public good. Such diversity in viewpoints can help governments make sound decisions as it aids proper evaluation of policies them a variety of …","date":-62135596800,"description":"","objectID":"b7e0b2903ea87d8942dbd49ea4ee6261","permalink":"/el-notes/prejudice-and-discrimination/how-far-is-the-trend-towards-diversity-a-positive-development/","title":"How far is the trend towards diversity a positive development"},{"content":"Prejudice and Discrimination According to a 2021 Study by the New York University, the more an academic discipline is perceived to require raw talent or \u0026amp;ldquo;brilliance\u0026amp;rdquo; for success, the more both women and early-career academics feel professionally inadequate.\n","date":-62135596800,"description":"","objectID":"b5806a46288fcf21a9111c4cfba9c797","permalink":"/el-notes/prejudice-and-discrimination/readme/","title":""},{"content":"","date":-62135596800,"description":"","objectID":"ca023f282975c6a23ac4b6a3eabbf72d","permalink":"/el-notes/prejudice-and-discrimination/race/","title":"Race"},{"content":"","date":-62135596800,"description":"","objectID":"bdbf435f0ba21331ae4bcb384a7d90c6","permalink":"/el-notes/prejudice-and-discrimination/","title":"Prejudice and Discrimination"},{"content":"EL Notes If you want, please compile all statistics and data you find in this repository. For EL4131. Additional articles are also appreciated.\nDirectory Structure ├── Stats and Quotes Notes.m ├── tree.txt ├── Science and Technology │ ├── Science │ │ ├── People are placing too much faith in medical science. Do you agree.m │ │ ├── _index.m │ │ ├── As science advances, the human race regresses. Is this a fair comment.m │ │ ├── Ethics │ │ │ ├── Ethics in Science is more beneficial that the Science itself. Do you agree.m │ │ │ ├── Gene Editing │ │ │ │ ├── First monkey–human embryos reignite debate over hybrid animals - Nature │ │ │ │ ├── After the Nobel, what next for Crispr gene-editing therapies - The Guardian │ │ │ │ ├── Mixed messages - is research into human-monkey embryos ethical - The Guardian │ │ │ │ ├── _index.m │ │ │ │ ├── ‘CRISPR babies’ are still too risky, says influential panel - Nature │ │ │ │ ├── Chinese scientist who edited babies\u0026#39; genes jailed for three years - The Guardian │ │ │ │ ├── Genome editing for heritable diseases not yet safe, report states - The Guardian │ │ │ │ └── Gene editing like Crispr is too important to be left to scientists alone - The Guardian │ │ │ ├── _index.m │ │ │ └── Scientific Ethics - Visionlearning │ │ ├── The danger of modern science is that instead of teaching mankind humility, it has made us supremely arrogant.m │ │ └── Covid-19 │ │ ├── _index.m │ │ ├── Hesitancy │ │ │ ├── _index.m │ │ │ ├── COVID-19 - A global survey shows worrying signs of vaccine hesitancy │ │ │ ├── The first problem was vaccine supply. Now, it’s demand. - The Verge │ │ │ └── Vaccine hesitancy is putting progress against covid-19 at risk - The Economist │ │ ├── The world may never reach herd immunity against Covid-19 - The Straits Times │ │ ├── Ethics │ │ │ ├── Pandemic Trauma - How ‘Moral Injury’ Haunts People - The Atlantic │ │ │ ├── Who Decides Which COVID-19 Patients Get Ventilators - The Atlantic │ │ │ ├── COVID-19 Has Pushed India\u0026#39;s Junior …","date":-62135596800,"description":"","objectID":"9d0a9990a8029b969db1296cbede713a","permalink":"/el-notes/readme/","title":""},{"content":"\u0026amp;ldquo;As science advances, the human race regresses.\u0026amp;rdquo; Is this a fair comment? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-24-as-science-advances-the-human-race-regresses-is-this-a-fair-comment/\n“All of the biggest technological inventions created by man say little about his intelligence, but speak volumes about his laziness.” This quote, widely attributed to Mark Kennedy, does indeed speak volumes about the questions which we are confronted with today: has scientific discovery advanced, while the human race languishes, and even regresses? With increasingly brave forays into the fields of artificial intelligence, neuroscience, genetic engineering, as well as broader and long-ranging explorations of the universe, we are breaking frontiers barely dreamt about just a generation ago. However, every new discovery not only brings along with it questions of application, access and distribution, it also highlights the extent to which we are unprepared for dealing with the moral and ethical questions associated with these developments, and the extent to which humans have regressed in terms of skillset. The possible exploitation of various technologies to mankind’s detriment may not necessarily mean science is a barrier to society’s progress as the reality is that the advent of science and technology has in fact allowed us to better understand the world and its complex systems, solved social and economic issues and even improved the quality of life, which are all synonymous with prosperity for all. It would be erroneous and unjustifiable, therefore, to generalise and claim that as science advances, man regresses.\nCritics of science often argue that while technological advancements have provided us with endless possibilities and allowed us to meet our basic needs, the relatively newer and unregulated fields of science have indubitably opened avenues for it to be exploited. Without adequately evaluating the possible ramifications of mismanaging certain …","date":-62135596800,"description":"","objectID":"260eb626f05cec1c2480eb0bd3839e85","permalink":"/el-notes/science-and-technology/science/as-science-advances-the-human-race-regresses.-is-this-a-fair-comment/","title":"As science advances, the human race regresses. Is this a fair comment"},{"content":"","date":-62135596800,"description":"","objectID":"561638d79082baf7271e88801d420500","permalink":"/el-notes/science-and-technology/science/covid-19/booster-shots/","title":"Booster Shots"},{"content":"","date":-62135596800,"description":"","objectID":"2be8ddd34dbfe6d2e4888b4d35a3c353","permalink":"/el-notes/science-and-technology/science/covid-19/ethics/","title":"Ethics"},{"content":"","date":-62135596800,"description":"","objectID":"25ad6b2700a5d829d113c2ebc858b99a","permalink":"/el-notes/science-and-technology/science/covid-19/hesitancy/","title":"Hesitancy"},{"content":"","date":-62135596800,"description":"","objectID":"3efdd0ee638cfd4d1c662a14bd26f53e","permalink":"/el-notes/science-and-technology/science/covid-19/implications/","title":"Implications"},{"content":"","date":-62135596800,"description":"","objectID":"5bac382e9b8c46f741f92572a7aa3285","permalink":"/el-notes/science-and-technology/science/covid-19/inequality/","title":"Inequality"},{"content":"","date":-62135596800,"description":"","objectID":"7ac8d4f6ed8905ad106820a0de1c53f3","permalink":"/el-notes/science-and-technology/science/covid-19/","title":"Covid-19"},{"content":"\u0026amp;ldquo;Ethics in Science is more beneficial that the Science itself.\u0026amp;rdquo; Do you agree? Question Analysis:\n \u0026amp;ldquo;beneficial\u0026amp;rdquo;:  Benefitted whom?: Humans.    \u0026amp;ldquo;Ethics in Science\u0026amp;rdquo;:  Points Against    ","date":-62135596800,"description":"","objectID":"52b21b987d701569db5031189001cfe6","permalink":"/el-notes/science-and-technology/science/ethics/ethics-in-science-is-more-beneficial-that-the-science-itself.-do-you-agree/","title":"Ethics in Science is more beneficial that the Science itself. Do you agree"},{"content":"","date":-62135596800,"description":"","objectID":"863b1c7a02991c44b8ff37032ea7a69e","permalink":"/el-notes/science-and-technology/science/ethics/gene-editing/","title":"Gene Editing"},{"content":"","date":-62135596800,"description":"","objectID":"09bfb9730b7afba8ba4ee34d89832d1b","permalink":"/el-notes/science-and-technology/science/ethics/","title":"Ethics"},{"content":"\u0026amp;ldquo;People are placing too much faith in medical science.\u0026amp;rdquo; Do you agree? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-18-people-are-placing-too-much-faith-in-medical-science-do-you-agree/\n“A gramme is better than a damn.” The subtle yet incredibly potent phrase is continuously remembered by the members of a seemingly utopian society in Aldous Huxley’s novel ‘Brave New World’ whenever they feel unhappy. They spontaneously turn to a gramme of soma, a narcotic touted to be a medical marvel that subdues any undesirable, negative feelings and provides instant gratification. This could arguably be one of the most extreme cases of excessive faith placed upon medical science, if one were to rely on and expect drugs to control one’s feelings, the central aspect that defines a human. Over the past century, the medical industry has expanded greatly, as researchers have been making great strides in understanding the human anatomy and introducing medical inventions that serve to prolong and enhance life. Coupled with a plethora of public health measures such as control of infectious diseases, clean water and modern sanitation, the average life expectancy of humans has increased tremendously. It can therefore be concluded that medical science has delivered on its promise. The question that now rears its ugly head is whether the burgeoning field of medical science has prompted people to place an inordinate amount of trust on it, to an unrealistic and unsustainable extent. Given the endless possibilities of medical technology, it is highly likely that people would expect it to cure all ailments, or enhance certain features, which may lead to negative repercussions, posing a threat to patients, their families and the medical fraternity. That said however, there are also rare instances in which there is a lack of trust in medical science due to its unpredictable nature.\nAdvances in medical science have provided cures for a wide range of debilitating diseases …","date":-62135596800,"description":"","objectID":"8e83db234d7a83a7d4c2b16014318c5c","permalink":"/el-notes/science-and-technology/science/people-are-placing-too-much-faith-in-medical-science.-do-you-agree/","title":"People are placing too much faith in medical science. Do you agree"},{"content":"\u0026amp;ldquo;The danger of modern science is that instead of teaching mankind humility, it has made us supremely arrogant.\u0026amp;rdquo; Comment. In his bestselling book ‘Homo Deus: A Brief History of Tomorrow’, Professor Yuval Noah Harari commented that “during the Agricultural Revolution, humankind silenced animals and plants, and turned the animist grand opera into a dialogue between man and gods. During the Scientific Revolution, humankind silenced the gods too.” In fact, the very premise of Harari’s seemingly outlandish claims is that modern science has made men gods; although the best and the brightest understand that scientific research simply reflects the inadequacy of human knowledge, the accessibility and transformative power of modern science has granted us an immeasurable amount of power which we are wont to abuse. This power manifests itself in terms of the ability to control fellow human beings, manipulate the biological building blocks of life, and decide the fate of all other forms of life on this planet, all of which we are already doing with impunity.\nIt should be established that the objective of scientific research is to produce accurate explanations of how the natural world works, and this is a slow and laborious empirical process. Proponents of the scientific method argue that the modern sciences have taught us just how little we know about the universe. As Valentine, a character of Tom Stoppard’s ‘Arcadia’ noted whimsically: “It makes me so happy. To be at the beginning again, knowing almost nothing…The ordinary-sized stuff which is our lives, the things people write poetry about—clouds—daffodils—waterfalls—what happens in a cup of coffee when the cream goes in—these things are full of mystery, as mysterious to us as the heavens were to the Greeks…It’s the best possible time to be alive, when everything you thought you knew is wrong”. Scientific discovery is premised on the fact that nothing can ever be found or proven to be right; it can only be proven …","date":-62135596800,"description":"","objectID":"f7c7b7f039fa48666e30a4f3067702e5","permalink":"/el-notes/science-and-technology/science/readme/","title":""},{"content":"\u0026amp;ldquo;The danger of modern science is that instead of teaching mankind humility, it has made us supremely arrogant.\u0026amp;rdquo; Comment. In his bestselling book ‘Homo Deus: A Brief History of Tomorrow’, Professor Yuval Noah Harari commented that “during the Agricultural Revolution, humankind silenced animals and plants, and turned the animist grand opera into a dialogue between man and gods. During the Scientific Revolution, humankind silenced the gods too.” In fact, the very premise of Harari’s seemingly outlandish claims is that modern science has made men gods; although the best and the brightest understand that scientific research simply reflects the inadequacy of human knowledge, the accessibility and transformative power of modern science has granted us an immeasurable amount of power which we are wont to abuse. This power manifests itself in terms of the ability to control fellow human beings, manipulate the biological building blocks of life, and decide the fate of all other forms of life on this planet, all of which we are already doing with impunity.\nIt should be established that the objective of scientific research is to produce accurate explanations of how the natural world works, and this is a slow and laborious empirical process. Proponents of the scientific method argue that the modern sciences have taught us just how little we know about the universe. As Valentine, a character of Tom Stoppard’s ‘Arcadia’ noted whimsically: “It makes me so happy. To be at the beginning again, knowing almost nothing…The ordinary-sized stuff which is our lives, the things people write poetry about—clouds—daffodils—waterfalls—what happens in a cup of coffee when the cream goes in—these things are full of mystery, as mysterious to us as the heavens were to the Greeks…It’s the best possible time to be alive, when everything you thought you knew is wrong”. Scientific discovery is premised on the fact that nothing can ever be found or proven to be right; it can only be proven …","date":-62135596800,"description":"","objectID":"134d0a8b26c91a84018ead4ce9100daa","permalink":"/el-notes/science-and-technology/science/the-danger-of-modern-science-is-that-instead-of-teaching-mankind-humility-it-has-made-us-supremely-arrogant/","title":"The danger of modern science is that instead of teaching mankind humility, it has made us supremely arrogant"},{"content":"","date":-62135596800,"description":"","objectID":"4b1de74fb5aa7f7ae5926c5e78edc8d5","permalink":"/el-notes/science-and-technology/science/","title":"Science"},{"content":"To what extent is artificial intelligence replacing the role of humans? To a limited extent.\nDefinitions    Word Definition     Role of Humans Tasks that require some form of intelligence and decision making / creative thinking rather than menial labour.    Points  AI today requires human intervention to be maintained  All advanced critical thinking of AI requires collaborating with an AI GitHub Copilot: requires humans to suggest what they wish to code, Copilot is simply a tool (Literally called copilot)   AI requires advanced computations that may not be easily executable in normal settings?  GPT-3 exists, but you have to access it from an API, and you can only use a limited set of API requests?   AI does not have a just set of ethics how do you fudging justify this  The Moral Machine: Driverless Cars    ","date":-62135596800,"description":"","objectID":"1f28b2fa6350fa23e9f8be484b99d73c","permalink":"/el-notes/science-and-technology/tech/ai/to-what-extent-is-artificial-intelligence-replacing-the-role-of-humans/","title":"To what extent is artificial intelligence replacing the role of humans"},{"content":"","date":-62135596800,"description":"","objectID":"912775d4178d88c166b58847b216e720","permalink":"/el-notes/science-and-technology/tech/ai/","title":"AI"},{"content":"","date":-62135596800,"description":"","objectID":"ec68cf59ed27ceb4a82e24953c6f5690","permalink":"/el-notes/science-and-technology/tech/autonomous-vehicles/","title":"Autonomous Vehicles"},{"content":"Is the protection of privacy worthwhile? Source: https://www.theknowledgeloft.com/gp-essays/is-the-protection-of-privacy-worthwhilegp-essay-5/\nIndividual privacy has been at the forefront of debates for years with many across the globe constantly weighing the need for privacy against the need for governments to monitor what people are doing in order to prevent events of mass terror. With the rise in terror attacks in the past five years in particular, this discussion has become more critical than ever. The question that needs to be addressed is whether the protection of privacy and thus people’s rights to not have their lives monitored is worth the risks of allowing terrorism, violence and crime to continue to grow, and my view is that the protection of privacy is worthwhile to the extent that it does not impinge on the need for governments to protect the safety and welfare of their people.\nThe protection of privacy is worthwhile as a matter of principle, since it is the only thing that stands between an individual’s freedom of expression and living in a lifeless dystopian state. The protection of privacy is inextricably tied up with the protection of individual freedom, with the loss of privacy effectively meaning the loss of people’s rights to their lives, since every decision, choice and action taken from that point onwards would be monitored by the state. This effectively takes away people’s freedom to choose as every decision must be held to the standards of the law and the people monitoring them, creating an environment where people will never be free to act and behave like themselves. Examples of this sad reality have been described throughout popular culture although with added dramatization such as the dreary depiction of life in George Orwell’s renowned novel ‘1984’ and the movie based on the novel which depicts the dark dystopian future that could await people if they choose to forgo their right to privacy. By giving states control over individual’s …","date":-62135596800,"description":"","objectID":"fdb14b772ee3ac142f93bff4142f3d4d","permalink":"/el-notes/science-and-technology/tech/big-tech/is-the-protection-of-privacy-worthwhile/","title":"Is the protection of privacy worthwhile"},{"content":"Is there still privacy in today\u0026amp;rsquo;s world especially given the need for national security? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-45-is-there-still-privacy-in-todays-world-especially-given-the-need-for-national-security/\n“To be left alone is the most precious thing one can ask of the modern world,” quipped English writer Anthony Burgess. While alluding to solitude and being alone, this quote has seen greater relevance in modern times with respect to one’s privacy. Privacy – the ability of an individual to keep information regarding him away from the knowledge of others – is becoming an increasingly debatable issue. Unfortunately, as much as people desire for their personal information to be kept solely to themselves, this is getting increasingly impossible in today’s world as technology has allowed organisations such as governments to tap into personal information against the will of individuals for the purposes of national security. Nonetheless, contrary to popular belief that privacy no longer exists, there are many instances where privacy still remains, such as the cases of political privacy and laws to protect privacy rights of citizens. As such, it is erroneous to claim that there is no more privacy in today’s world.\nIn today’s world, it appears as if privacy may need to be sacrificed for the sake of national security. After various catastrophic acts of terrorism, such as the notable 9/11 attacks against New York’s World Trade Centre, it is quintessential for governments to fulfil their role of protecting their citizens by preventing such acts from happening again. In an increasingly globalised world characterised by greater movements of people and goods across international borders daily, national security needs to be improved to deter any potential threats to a country’s security and the safety of its citizens. With improvements in surveillance technology to collect and analyse data of large numbers of people, governments can easily …","date":-62135596800,"description":"","objectID":"6e0941d33c6eb059a4e509014bf3de09","permalink":"/el-notes/science-and-technology/tech/big-tech/is-there-still-privacy-in-todays-world-especially-given-the-need-for-national-security/","title":"Is there still privacy in today's world especially given the need for national security"},{"content":"","date":-62135596800,"description":"","objectID":"83938c77c014546717f22912b44e6c5d","permalink":"/el-notes/science-and-technology/tech/big-tech/","title":"Big Tech"},{"content":"\u0026amp;ldquo;Entertainment, not truth, is the priority of the media today,\u0026amp;rdquo; Comment. Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-11-entertainment-not-truth-is-the-priority-of-the-media-today-comment/\nWill Rogers once said, “All I know is just what I read in the papers, and that’s an alibi for my ignorance.” It is now fashionable to degrade the media for obscuring verifiable facts that is in the public interest to be made aware in favour of providing amusement and enjoyment to its audience. However, it is important to recognise that media is not a homogenous collective and the priorities of the media cannot be reduced to a simple dichotomy. From mainstream media to para-journalism, to New Media, various forms of media have varying priorities, and this is dependent on how they generate profit and the desires of their target audience.\nWhile mainstream media, which refers collectively to various large mass news media that are capable of influencing a large number of people, and both reflect and shape prevailing currents of thought, does at times obfuscate the truth, this may not be because it prioritises entertainment or strictly speaking the pleasure of its readership. It is arguably true that mainstream media sources have devoted more resources to entertainment news, rather than news that strictly concerns public interests. A quick perusal of The Straits Times suggests that more sections of the newspaper are dedicated to ‘lifestyle news’, which covers celebrity news, travel tips and food recommendations or recipes. The fact that major mainstream news sites like the British Broadcasting Company (BBC) and Cable News Network (CNN) ran widespread coverage on a plump rat being extracted from a manhole in Germany suggests that amusing readers has perhaps become a greater priority than ever before. Whether it has overtaken bringing the truth to light, however, is still under question. Furthermore, it should be acknowledged that mainstream media does also tend …","date":-62135596800,"description":"","objectID":"d5cf54843d21f9d334b5590f775c38cc","permalink":"/el-notes/science-and-technology/tech/cancel-culture/entertainment-not-truth-is-the-priority-of-the-media-today-comment/","title":"Entertainment, not truth, is the priority of the media today, Comment"},{"content":"","date":-62135596800,"description":"","objectID":"26f1a4b0024799b56821b56c7b85335b","permalink":"/el-notes/science-and-technology/tech/cancel-culture/","title":"CANCEL CULTURE"},{"content":"In an age of rapid technological advancement, is a single career for life realistic? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-38-in-an-age-of-rapid-technological-advancement-is-a-single-career-for-life-realistic/\nA recent LinkedIn survey found that if you are less than 32 years old, you are likely to change jobs at least four times before you reach that age. By 2001, only half of the workforce in the United Kingdom had been in continuous employment for a period longer than four years. Yet another survey by staffing firm Robert Half found that 64% of workers favour what is known as ‘job-hopping’, particularly the younger generation, with 75% of employees under 34 believing in the benefits of job-hopping. A single career for life used to mean climbing the corporate ladder, stability in income and to a certain degree, specialisation. However, in an age of rapid technology advancement, how ‘work’ is organised and what people feel about it have clearly changed. I believe that a single career for life, save for some professions and for some individuals, is no longer realistic nor desirable.\nThere is no doubt that, the age of rapid technological advancement has led to what is known as ‘de-skilling’. Back in the 1930s, the term ‘technological unemployment’ was coined by John Maynard Keynes as he forecasted how the ways in which we economise the use of labour would outpace the creation of uses for labour, leading to increases in unemployment. Original unskilled tasks filled by factory workers can be even further broken down, to be automated and performed by machines instead. Such technological innovations in manufacturing and communications have already led to rapid decreases in blue-collar, manufacturing jobs in many developed countries. It was estimated by Oxford professors Carl Benedikt Frey and Michael Osborne that 47 percent of American jobs are at risk of automation. Places like Hong Kong and Singapore have all experienced de-industrialisation, with …","date":-62135596800,"description":"","objectID":"125fc3dafa71dbf0db067912f6b01e59","permalink":"/el-notes/science-and-technology/tech/in-an-age-of-rapid-technological-advancement-is-a-single-career-for-life-realistic/","title":"In an age of rapid technological advancement, is a single career for life realistic"},{"content":"","date":-62135596800,"description":"","objectID":"28633d3b36549faf49833c3cfeaa216f","permalink":"/el-notes/science-and-technology/tech/prejudice/","title":"Prejudice"},{"content":"\u0026amp;ldquo;Social Media divides more than it unites.\u0026amp;rdquo; To what extent is this true? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-23-social-media-divides-more-than-it-unites-to-what-extent-is-this-true/\nIt all started with Six Degrees. Launched in 1997, this website enabled users to upload a profile and make friends with other users. It was the predecessor of the many social networking sites to come, and its creation heralded the advent of a new era – an era in which social media would emerge as a new medium of communication. Defined as a group of Internet-based applications that allow the creation and exchange of user-generated content, social media takes on many different forms, from social networks to social news to even Wikis. Given how pervasive social media has become, it is indisputable that it can influence individuals, and hence wields the power to both divide and unite the community. While it has the potential to create rifts within society by perpetuating existing divides like the generational divide and creating echo chambers, it has an even greater potential to bring individuals together. It cuts across physical boundaries to unite, facilitates the sharing of different opinions, and sheds light on various otherwise unknown situation. Therefore, social media does not, in fact divide more than unite.\nAdmittedly, social media does perpetuate and exacerbate the generational gap between the older and the younger generations of today. The younger generation are known as ‘digital natives’ who have grown up with technological gadgets as their toys and social media as a legitimate means of self-expression. In fact, according to a research conducted by Pew Research Centre on 700 American youth in 2018, close to 95% of teenagers have access to a smartphone, and 45% say that they are online on social media platforms on a ‘almost constant’ basis. The older generation is remarkably less adept at using technology and social media: while 90% of those …","date":-62135596800,"description":"","objectID":"675ff762cfd14a3fe8cd10c7173d8d30","permalink":"/el-notes/science-and-technology/tech/social-media/social-media-divides-more-than-it-unites.-to-what-extent-is-this-true/","title":"Social Media divides more than it unites. To what extent is this true"},{"content":"","date":-62135596800,"description":"","objectID":"a5a63f33d3d9a0cfd480f214cd94d2fe","permalink":"/el-notes/science-and-technology/tech/social-media/","title":"Social Media"},{"content":"To what extent has technology had a negative impact on the skill levels of people? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-21-to-what-extent-has-technology-had-a-negative-impact-on-the-skill-levels-of-people/\nMankind has always had a knack for finding the easy way around the most difficult tasks. Once we developed the technology needed to survive the brutal forces of nature in the Stone Age, mankind embarked on a journey of technological advancement in pursuit of a better life. Ironically, in our quest to automate and optimize our processes, we have become heavily reliant on technology, rendering many skills that were once considered fundamental and essential useless. Therefore, I believe that technology, while greatly improving our quality of life, has had an adverse impact on the skill levels of mankind.\nThe negative impact that technology has had on our interpersonal skills is perhaps the most pervasive and insidious one yet. Technological advancements in communication – more particularly the development of the smartphone – has revolutionised the way we interact. Texts and direct messages have now substituted face-to-face interaction, and emojis and stickers are at present the most convenient conveyors of our mood. With the younger generation of today growing up in a world like this, many of them are more comfortable with socializing online than in real life. Undeniably, this new form of communication has many perks: speed, immediacy, and the ability to avoid direct confrontation are just a few. However, this has led to many of them losing their ability to communicate effectively with others. They shy away from situations that require them to mingle, choosing to use social media to get to know others instead. They are better able to sustain a conversation online than offline, to read text cues than a change in tone, to interpret the blue tick than body language. This dependence has resulted in a situation where many use their smartphones even …","date":-62135596800,"description":"","objectID":"be749548adb678d68b34aa7593e416e6","permalink":"/el-notes/science-and-technology/tech/tech-talent-crunch/to-what-extent-has-technology-had-a-negative-impact-on-the-skill-levels-of-people/","title":"To what extent has technology had a negative impact on the skill levels of people"},{"content":"","date":-62135596800,"description":"","objectID":"336b8a07764f698b9576ab6e87611346","permalink":"/el-notes/science-and-technology/tech/tech-talent-crunch/","title":"Tech Talent Crunch"},{"content":"\u0026amp;ldquo;Technology should only be tolerated in so far as it aids the human condition.\u0026amp;rdquo; To what extent do you agree? Question Analysis:\n  \u0026amp;ldquo;tolerated\u0026amp;rdquo;:\n If it surpasses the condition: no funding, no research, no technology suckers     \u0026amp;ldquo;human condition\u0026amp;rdquo;:\n Human Needs that can be assisted by Technology?     \u0026amp;ldquo;aids\u0026amp;rdquo;:\n Is technol    ","date":-62135596800,"description":"","objectID":"ea21de7cb90f56bbbf630ba430adba12","permalink":"/el-notes/science-and-technology/tech/technology-should-only-be-tolerated-in-so-far-as-it-aids-the-human-condition-to-what-extent-do-you-agree/","title":"Technology should only be tolerated in so far as it aids the human condition - To what extent do you agree"},{"content":"Theranos Theranos has been a very clear indicator of how much trust we have in technology today. The scandal was one of the many such cases involving market fraud and the misleading of shareholders over the past few years and has been helmed as Silicon Valley’s Greatest Disaster. With an idea as incredible as was the founder’s, Elizabeth Holmes, who possessed a very limited amount of knowledge regarding medical trials and entrepreneurial methods and a small patent developed within a few five days, Theranos seemed doomed from the start, yet it grew from a simple start-up in 2003 to a highly valued company with a valuation of about 9 billion dollars in 2014. In a few short years, the medical company had grown to the point that Holmes was now the richest self-made female billionare in the world, yet all it had was a disappointing line-up of inaccurate products with fabricated results that left many flabbergasted. Holmes had somehow managed to convince stakeholders and even the board of directors of her own company to let her continue the fraud.\nSexism in Tech The Elizabeth Holmes Trial Is a Wake-Up Call for Sexism in Tech - Ellen Pao (15/09/2021)\n","date":-62135596800,"description":"","objectID":"5f7deea9cb2815e0a9829f1fe60c0fde","permalink":"/el-notes/science-and-technology/tech/theranos/readme/","title":""},{"content":"","date":-62135596800,"description":"","objectID":"0d4207045c27010c105d9b72e84b6ea7","permalink":"/el-notes/science-and-technology/tech/theranos/","title":"Theranos"},{"content":"To what extent does social media pose a challenge for the government? Source: https://www.theknowledgeloft.com/gp-essays/gp-essay-30-to-what-extent-does-social-media-pose-a-challenge-for-the-government/\nThe expansion of online social networking has given citizens unprecedented ability to share information, create communities and organize social movements. From a governmental perspective, this could be quite a challenge as social media may be used as a platform to directly challenge the government. It is also a ‘Wild West’ in which misinformation could spread and hatred incited quickly with little means for regulation. Currently, while there are measures to mitigate the challenges posed by social media, they are still in their infancy and likely, very limited in their effectiveness. At the same time, the benefits of social media hardly offset the challenges, and hence it is reasonable to argue that social media poses more of a challenge to governments than not.\nThe widespread reach and unregulated nature of social media is perhaps the biggest reason governments find it a challenge. According to the International Communication Union, there are more than 3 billion Internet users worldwide. Most will have access to social media of some sort—such as Facebook, Instagram, Twitter, YouTube and LinkedIn. This means that large segments of the population could be influenced by the use of social media for communication, either directly or indirectly. These platforms are difficult to regulate as there are very few existing laws governing social media, and it is difficult to enforce rulings when the platform’s owners are based in a different country. The sheer volume of information on those platforms also makes it impossible for regulators to keep close watch on everything. The most famous use of social media to challenge governmental authority is perhaps the Arab Spring of 2011, where social media was used to rapidly spread awareness of and coordinate the protests. The uprising …","date":-62135596800,"description":"","objectID":"9f097fd74c3dc475f368ae47c903d523","permalink":"/el-notes/science-and-technology/tech/to-what-extent-does-social-media-pose-a-challenge-for-the-government/","title":"To what extent does social media pose a challenge for the government"},{"content":"","date":-62135596800,"description":"","objectID":"6b6ae6edb85658e2ee89e040464d64ed","permalink":"/el-notes/science-and-technology/tech/youth/","title":"Youth"},{"content":"","date":-62135596800,"description":"","objectID":"bd58be4a425510d1d92acd32c3e20cd9","permalink":"/el-notes/science-and-technology/tech/","title":"Tech"},{"content":"","date":-62135596800,"description":"","objectID":"8539fd76e9540312721e50510c821885","permalink":"/el-notes/science-and-technology/","title":"Science and Technology"},{"content":"Table of Contents\n Science  Definitions Quotes Examples Stats   Technology  Definitions  Cancel Culture Big Tech AI   Quotes  Cancel Culture Morals and Ethics   Examples  Big Tech Cancel Culture AI  Autonomous Vehicles     Stats  Big Tech and Big Data Morals and Ethics Youth Tech Talent Crunch     Prejudice and Discrimination  Definitions Quotes Examples Stats   Crime and Punishment  Definitions Quotes Examples Stats    Science Definitions Quotes Examples Stats COVID-19 Vaccination   high-income economies with around 16% of the world\u0026amp;rsquo;s population have secured over 70% of 5 major vaccine doses for 2021 Source: Challenges in ensuring global access to COVID-19 vaccines: production, affordability, allocation, and deployment Notes: Research paper on theLancet, found on Fortune. Both are not so well known sources\n  Covax has pledged to send 200 million vaccine shots to some 92 countries. However only 30 million has been received. Article: The Straits Times - Problems at biggest vaccine maker in Indialeave world short on Covid-19 shots\n  Serum\u0026amp;rsquo;s CEO, Adar Poonawalla, pledged 400 million doses for low and middle-income countries by the end of 2020. As of Jan 2021, only 70 million shots were manufactured. Article: The Straits Times - Problems at biggest vaccine maker in Indialeave world short on Covid-19 shots Notes: Mr Poonawalla mentions that the company is uncertain about when it would receive a licence from India and did not have enough warehouse space.\n  Sexism  58% of Women with STEM Degree have STEM Jobs, 70% of men with STEM Degree have STEM jobs Source: Study by Nanyang Technological University Notes: Dataset of 738 Singaporeans  Technology Definitions Cancel Culture  \u0026amp;ldquo;Cancel\u0026amp;rdquo;: To effectively end their career or revoke their cultural cachet, whether through boycotts of their work or disciplinary action from an employer. \u0026amp;ldquo;Cancel Culture\u0026amp;rdquo;: The culture of cancelling people who have done something bad in the eyes of the public, which …","date":-62135596800,"description":"","objectID":"0be4595ea08aa5d859dc529a8b7995b9","permalink":"/el-notes/stats-and-quotes-notes/","title":"Stats and Quotes Notes"},{"content":"Hello world!\n","date":1508248845,"description":"","lastmod":"2017-10-17T14:00:45Z","objectID":"a37038ea9c0a627175646a70bd3fc060","permalink":"/hello_world/","publishdate":"2017-10-17T14:00:45Z","title":"Hello world!"}]